
  #### Terraform Plan (prod) 📖`success`

  <details><summary>Show Plan</summary>

  ```terraform
data.google_iam_workload_identity_pool.github-id-pool: Reading...
data.google_kms_secret.identity_github-client-secret_EDD212F4: Reading...
data.google_kms_secret.identity_github-client-secret_EDD212F4: Read complete after 1s [id=tasuke-prod/global/terraform/secrets:CiQAZMaw+7BP/irMmJ8eSU2HOwjqq7FCFb2eBS7B1gxcYCpfrKQSUQAg6KTI4Fvw72Q+pfAjLR34Qzrd2ChGWiuargOzu1M2h0XnB7k+vsNt6OswVxgZcX26Z6xJkSCRsxXoX2fhD46V2//lQeb/xlbAGPHhtNse/w==]
data.google_dns_record_set.dns_dev-delegate-ns_03BD8150: Reading...
data.google_iam_workload_identity_pool.github-id-pool: Read complete after 1s [id=projects/tasuke-prod/locations/global/workloadIdentityPools/github]
data.google_dns_record_set.dns_dev-delegate-ns_03BD8150: Read complete after 0s [id=projects/tasuke-dev/managedZones/alpha-tasuke-dev/rrsets/alpha.tasuke.dev./NS]
data.google_kms_secret.secrets_github-app-private-key-base64-decrypted_2C1423BC: Reading...
data.google_kms_secret.secrets_github-app-private-key-base64-decrypted_2C1423BC: Read complete after 0s [id=tasuke-prod/global/terraform/secrets:CiQAZMaw+8WkJobEoj6qsuUEuzCVj2tZ/J0Es0BZjAza6w/gdDMS6xEAIOikyNsuafmmshgAhIuRf2PKqEe7MbRHAv0vPadc7ga/XY+pG/ST8wPD0apzdD1yUpYIOMrjjOZ1aFT9q0WP58I/RCvsBLsYgJhMnCcCI03nIuLgbjFMlEOS0nRMv5XHdsjdU9KkuYKn+aj+ae/FiMvmKx63+cePXD4/UrPATKHSYiDuW3Z6vkpGX3Lj4Gz0brSAeKoriDCRXmZ3bPpdiJTBcqTjkt3gqACghVLLUQEb0wWnasRMZVM0GtuBoU7m/EaF5vvdT+M+o//bmnHf/ECPigilPU9QuiLBCRzs2L4glH4H9NLxXHy04qtoBsoaoRd6boCAUYNYpGZ8vO0K6S8KZra7yX3uWM/c/9Db65Aaa57HhQK3PIDESvVK/kafuAUFonSpnAVOQqbeq4eWklAYkfshaZ9c9CCCIMG72cqUtdi+pppKiia3BgvWMCoHCMUy0+tckikz5i9sqlgonFGrF4IRqw+eER4pskecvz967LdIgM2SSzsaRhLLF8hNfMVs8HCBXadc4DJEFJ2F2TKiIi4QTM2Yb4oDc37zHPTScoTLuIT3OSkPNacvNtjmcw7yCc6Qe8PDmTv8t8GtdBh3mnCBj1qWyxAA7SGQ1fraKMtY692QITfssWVeJNbeA7QeHYFgt1DDloTxfuV7dUJKMGJH4JemFKFMnkzkVHcbrnNswXS9vnFbjaCGfUPGN9Liipg1rz3ssxSd5Io2srq504HJ8lRKWuAHWtHuOeaXD22udcBKhwkO0oCS2CCESy5alypHphshDjZeV5PxWcNElB9fSxMJW58L0SdnLTFvy/3VALlbHMNuhbL+8tiMToY3FX/EId0MHPqkgGsEZZQSulK2aRZs3X4uGO/xdnSl6OqPN5IkxcrGSaCtUm4cUXXpni4FnBaAmaBEsU78yGn1fgCpalNJo1tWsqFZF6+mWrxyh8EGLhpCBCIQOFsPkyj2AwQaaHk+1z8lfWLDTUHhucM0AzKeH9iG53e69vMaf54k60aDv1Z38f30/rhcJTzN315fRS2/DUMMVDmaEm7js1jP87/qtRkzdpw1NuPIggSzf5ukSubRwpzjdIvGZB1oXG9QGGNbeehiDnR12+5SNbC1n62WUSJjakdLOOaesQISeDgMYN7BzbwatEPpUnp+4Ug0HbkMdNYY1PzcLJ7QX5TUEdo9jp9B21k6oChsupLZygisHyS1Rsfbx+znp0liy38p01vB/5Ync5wKT3jgff7TPHKxicu/eNRos+7tT9N74Za547MWEDRtonRZL8t60qR5m+CxYlj+uTeBVxJsRb6f0eFGsTMIERzowWeFIe77ZmZgmO6H4oQsJGpIvG6SETZxjmFH6dTbzTmUamq7zuWhHkZEt9iKZxEwbxj4E46Z8tiIoA0/3M6b/FUBjdrEINTFX0CpE+qLaE+Lx/Qt4ocpFfDzNMlPdI1+CgXI0yhQfpJ+AACFvxJ693MCaH+QXCk4ewU7zd0imK5RTxpJk4UiKFJckJzmQlOLzoojftSeOihDydIUYI0VSDugePXKN5uD/LCGsQyZOZFu79X62JVxoMd8U71OUhzlNczvg+B/xZKVrq59FvKXLEFePfuR4xAI+/jOwNT3B9jD2V4pQmx1lEDJLru8DvQoWH1N0g3WG3p3u6ifjGdTLglV2lVKhJ1/PtUWtwAgXX9ylnqbABR7I0/s3o4uEDjYX+4EFjQhW89NvoDD42+P529eoann4CkaFG9xnlREe8PeBBaQxITay5BmOGkgrzGMPhCU/To8eSIo2SHhqMacOxruvGLEnUBI/L3apB2FYA1f4QWAPrWOkAnIt5U4HvlBRr36168ASUwjWoZRmQJo9RVsY3hzg4Sasvm7jPVjKuEtGnL44cE7EsV9Mu+3jiQEGYUbzOO8nrVY1qCGDcKZ70MSeO29oWVDPUDgPRUkOTG/5SSDTtYXz2Pz8JKAt9Kifz+8H/mnHkaT0ntENemPq1YaSQ1nufSdphZ0g6j9oAa3+bDLt6E9o3bLv1cjKOFdbPawCmjkWfgtkP3wu5wcdlk2fTZmUDvz866zdapkzDpAbhdDQX6YSf77VplA0QVLmBOWcxVvc6GL+SRA7X1DZXkerMTdbMLW1d9upz9QqANgrCkcdBwj1B5CjThWxj1jz6ekrle8/WjZW8h71Q1rDHg/F0YuzD0QC6/gHMBv2AQuK6BiY+kOjJi/3teeApu8dNvtq5PCuKjsO/V/APmNRK3kiIKKPXi8q70/L938wvsw2JdnlW8c0i4yfM8oX/dUhd0TMwvepIfyjBfESTHpgvkrnxCHTGtGCvCJ2Ujl+HtupYr0e3dcuxqoT9Lq7vpR/xUFma/aVBsgAOYNC8yQuJ4/+eMAxFNhLa/fHTEbei5xTJhWzGLUHytXFfJZle0aHnYNW3MhfHFBLWOPoMoV1Eq+kn3njArUfsaJ2x4G+SCWQrVYJXQtdyv7ZSoUuzJ045mws+sWg4L98Nvht8WcLY16ziB+Itu1fqX3h64DePMmi00lwlHEBvGDIRbsSrIyLOf3l6ivokJodmtnkd/07Ows6SYq9arLmpwBFSLL5Pk/LWJpTd9pw4f+JrRVUE0imWN0avSPh62gmJXN++Hogd0br/QdGXnQ0Hg133UZd3LmpFvHerVe2eD58sKq7fntJ2sJG3SJ+/umtCK9LdhWqwmJkDeP0P5BczO/fpfhrrsva82svn0AfD4EaHaScz73W/HBrsJNYNOC15zkTlTw8je3gEJSFvtPkezQ27OhRUpohNrNOcb/oGFWXF07x5T0M5kTrqlkuFyX2fgszSZQAWMdHQye6Gp957rWBCtYPmoDFRN91ifTDXsBbgKszRgIHMNB7e7LSozIKZGQHGmSgJ1r0hkAzisMWinofWqXEuIMHDLyn6sln1BwjzrbdHAseo+qtO88R6xoo9bkF7gSE/t/d+r3B++NI+Wl3JjbSetKwgab7lVVqB51irD18eM7V+dBZuIDlXa72ZISBqfB/ZgdDfMf7FCMoUIDCAoeevIMMaivGGYVrwMD/dM=]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_service_account.service-accounts_choko-test_5D28252F will be created
  + resource "google_service_account" "service-accounts_choko-test_5D28252F" {
      + account_id = "choko-test"
      + disabled   = false
      + email      = (known after apply)
      + id         = (known after apply)
      + member     = (known after apply)
      + name       = (known after apply)
      + project    = "tasuke-prod"
      + unique_id  = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

  </details>
